._design_docs/.test_reports/S12-B01-20260607-05/hybrid/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (D:\source\llama.cpp-jet\._design_docs\.test_reports\S12-B01-20260607-05\hybrid\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 11 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 1/2 VUs, 4 complete and 0 interrupted iterations
hit_probe   [  27% ] 1 VUs  0m01.0s/5m0s  03/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.4s/2m0s  1/1 shared iters

running (0m02.0s), 1/2 VUs, 9 complete and 0 interrupted iterations
hit_probe   [  73% ] 1 VUs  0m02.0s/5m0s  08/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.4s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.60' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 12      4.905406/s
    checks_succeeded...: 100.00% 12 out of 12
    checks_failed......: 0.00%   0 out of 12

    ✓ warmup 200
    ✓ probe 200

    CUSTOM
    cache_hit_prompt_ms............: avg=13.54ms  min=12.64ms  med=13.61ms  p(95)=14.03ms  max=14.14ms 
    cache_hit_rate.................: 100.00% 11 out of 11
    cache_miss_prompt_ms...........: avg=54.55ms  min=54.55ms  med=54.55ms  p(95)=54.55ms  max=54.55ms 
    cache_n_tokens.................: avg=3.666667 min=0        med=4        p(95)=4        max=4       
    requests_ok....................: 12      4.905406/s

    HTTP
    http_req_duration..............: avg=122.32ms min=105.31ms med=107.05ms p(95)=194.4ms  max=253.3ms 
      { expected_response:true }...: avg=122.32ms min=105.31ms med=107.05ms p(95)=194.4ms  max=253.3ms 
    http_req_failed................: 0.00%   0 out of 12
    http_reqs......................: 12      4.905406/s

    EXECUTION
    iteration_duration.............: avg=234.29ms min=205.39ms med=207.5ms  p(95)=369.51ms max=374.63ms
    iterations.....................: 12      4.905406/s
    vus............................: 1       min=1        max=1
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 22 kB   8.8 kB/s
    data_sent......................: 3.1 kB  1.3 kB/s



running (0m02.4s), 0/2 VUs, 12 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m02.4s/5m0s  11/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.4s/2m0s  1/1 shared iters